  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/8263fe9f-65b2-4f9d-b770-dba9dda6f815/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.west-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "west-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "azureuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.west-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "west-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet"
      }
  }

# module.west-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "west-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>